---
kind: method
id: M:Autodesk.Revit.DB.MEPSystem.GetCriticalPathSectionNumbers
zh: 系统
source: html/b68ff5b9-e8cf-2565-2b50-03a8d2489ac3.htm
---
# Autodesk.Revit.DB.MEPSystem.GetCriticalPathSectionNumbers Method

**中文**: 系统

Obtains a list of the critical path section numbers.

## Syntax (C#)
```csharp
public IList<int> GetCriticalPathSectionNumbers()
```

## Returns
The section numbers.

## Remarks
The section numbers are returned in order in the direction of flow.